index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-23 Tue 12:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Stock Margin</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Stock Margin</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8670ee1">1. Calculating Margin Percent</a>
<ul>
<li><a href="#orgc345eb5">1.1. Buying (Long) Stock</a></li>
<li><a href="#orgd667222">1.2. Shorting (Short) Stock</a></li>
</ul>
</li>
<li><a href="#orgb41a8c8">2. Margin Call</a>
<ul>
<li><a href="#org40c4ac1">2.1. Maintenance Margin</a></li>
<li><a href="#org41f92f8">2.2. Calculation</a>
<ul>
<li><a href="#org7c9dd4c">2.2.1. Price Triggering Margin Call (Long)</a></li>
<li><a href="#org8d4b4f3">2.2.2. Price Triggering Margin Call (Short)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
When an investor buys or shorts a stock on margin, they are using money from their broker.  Simply stated:
</p>

<ul class="org-ul">
<li>Buying stock on margin means the investor receives a loan from their broker, with the stock as collateral.</li>
<li>Shorting stock on margin means the investor receives a loan from their broker, with the cash proceeds from the short as collateral.</li>
</ul>

<p>
What should be clear to you by the end of the presentation, is that the margin loan is very safe.  Further, since the average investor doesn't know this, brokers are able to charge interest rates which are too high for their level of risk.  Thus, margin lending is a lucrative profit source for brokerages.
</p>

<p>
Lastly, note market behaves differently in futures and other derivatives markets, and so what follows should only be applied to stock purchases. 
</p>


<div id="outline-container-org8670ee1" class="outline-2">
<h2 id="org8670ee1"><span class="section-number-2">1</span> Calculating Margin Percent</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc345eb5" class="outline-3">
<h3 id="orgc345eb5"><span class="section-number-3">1.1</span> Buying (Long) Stock</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">long_margin_percent</span><span style="color: #839496;">(</span>purchase_price, number_shares, initial_margin_percent, present_price<span style="color: #839496;">)</span>:
<span style="color: #586e75; background-color: #073642;"> </span>   <span style="color: #6c71c4;">loan_amount</span> = purchase_price * number_shares * <span style="color: #839496;">(</span>1 - initial_margin_percent<span style="color: #839496;">)</span>
<span style="color: #586e75; background-color: #073642;"> </span>   <span style="color: #6c71c4;">margin_percent</span> = <span style="color: #839496;">(</span>present_price * number_shares - loan_amount<span style="color: #839496;">)</span> / <span style="color: #839496;">(</span>present_price * number_shares<span style="color: #839496;">)</span>
<span style="color: #586e75; background-color: #073642;"> </span>   <span style="color: #859900;">return</span> margin_percent

<span style="color: #859900;">print</span><span style="color: #839496;">(</span><span style="color: #2aa198;">"New margin percent is: "</span>, <span style="color: #6c71c4;">round</span><span style="color: #2aa198;">(</span>100 * long_margin_percent<span style="color: #b58900;">(</span>purchase_price = 100, number_shares = 100, initial_margin_percent = 0.6, present_price = 70<span style="color: #b58900;">)</span>, 2<span style="color: #2aa198;">)</span>, <span style="color: #2aa198;">"%"</span><span style="color: #839496;">)</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #268bd2;">double</span> <span style="color: #b58900;">long_margin_percent</span>(<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">purchase_price</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">number_shares</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">initial_margin_percent</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">present_price</span>)
{
    <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">loan_amount</span> = purchase_price * number_shares * (1 - initial_margin_percent);
    <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">margin_percent</span> = (present_price * number_shares - loan_amount) / (present_price * number_shares);
    <span style="color: #859900;">return</span> margin_percent;
}

printf(<span style="color: #2aa198;">"New margin percent is: %f\%\n"</span>, long_margin_percent(100, 100, 0.6, 70));
</pre>
</div>

<pre class="example">
New margin percent is: 0.428571%

</pre>
</div>
</div>


<div id="outline-container-orgd667222" class="outline-3">
<h3 id="orgd667222"><span class="section-number-3">1.2</span> Shorting (Short) Stock</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #268bd2;">double</span> <span style="color: #b58900;">short_margin_percent</span>(<span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">sale_price</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">number_shares</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">initial_margin_percent</span>, <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">present_price</span>)
{
    <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">K</span> = sale_price * number_shares + sale_price * number_shares * initial_margin_percent;
    <span style="color: #268bd2;">double</span> <span style="color: #6c71c4;">margin_percent</span> = (K - present_price * number_shares) / (present_price * number_shares);
    <span style="color: #859900;">return</span> margin_percent;
}

printf(<span style="color: #2aa198;">"New margin percent is: %f\%\n"</span>, short_margin_percent(100, 100, 0.6, 95));
</pre>
</div>

<pre class="example">
New margin percent is: 0.684211%

</pre>
</div>
</div>
</div>



<div id="outline-container-orgb41a8c8" class="outline-2">
<h2 id="orgb41a8c8"><span class="section-number-2">2</span> Margin Call</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org40c4ac1" class="outline-3">
<h3 id="org40c4ac1"><span class="section-number-3">2.1</span> Maintenance Margin</h3>
<div class="outline-text-3" id="text-2-1">
<p>
To protect their loan, your broker sets a maintenance margin percent.  If your percent margin decreases to the maintenance margin, this triggers a <code>margin call</code>.  A <code>margin call</code> meas you haveto put in more cash to increase your margin, or your broker will close your position.
</p>
</div>
</div>

<div id="outline-container-org41f92f8" class="outline-3">
<h3 id="org41f92f8"><span class="section-number-3">2.2</span> Calculation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
To calculate the price at which we get a margin call, we simply set our margin percent calculations above equal to the maintenance margin, and solve for the new price.
</p>
</div>

<div id="outline-container-org7c9dd4c" class="outline-4">
<h4 id="org7c9dd4c"><span class="section-number-4">2.2.1</span> Price Triggering Margin Call (Long)</h4>
</div>

<div id="outline-container-org8d4b4f3" class="outline-4">
<h4 id="org8d4b4f3"><span class="section-number-4">2.2.2</span> Price Triggering Margin Call (Short)</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-02-23 Tue 12:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
